sparks/ATetherBOOT/atmega_etherboot.c
#elif defined __AVR_ATmega163__
#define SIG2	0x94
#define SIG3	0x02
#define PAGE_SIZE	0x40U	//64 words

#elif defined __AVR_ATmega169__
#define SIG2	0x94
#define SIG3	0x05
#define PAGE_SIZE	0x40U	//64 words

#elif defined __AVR_ATmega8515__
#define SIG2	0x93
#define SIG3	0x06
#define PAGE_SIZE	0x20U	//32 words

#elif defined __AVR_ATmega8535__
#define SIG2	0x93
#define SIG3	0x08
#define PAGE_SIZE	0x20U	//32 words
#endif


/* define null response */
#define NULL_RESPONSE 0xFA


// ladyada mods - start after programming done & on power cycle!
#if defined(__AVR_ATmega168__) || defined(__AVR_ATmega328P__)
#define QUICKSTART_MODS 1
#endif


/* function prototypes */
void putch(char);
char getch(void);
static inline void getNch(uint8_t); // static inline saves a few bytes
void byte_response(uint8_t);
static inline void nothing_response(void);
char gethex(void);
void puthex(char);
void flash_led(uint8_t);
static inline void boot_program_page(uint32_t, uint8_t*);
int main (void) __attribute__ ((naked,section (".init9")));
uint8_t spi(uint8_t data); //Basic 8-Bit SPI exchange
uint8_t spi_W5100(uint8_t opcode, uint16_t address, uint8_t data); //Send a full 32-Bit Command to the W5100 chip
void sock_close();

/* some variables */
union address_union {
	uint16_t word;
	uint8_t  byte[2];
} address;

union length_union {
	uint16_t word;
	uint8_t  byte[2];
} length;

struct flags_struct { // changed from a packed struct to save some bytes
	uint8_t eeprom;
	uint8_t rampz;
} flags;

uint8_t buff[256];
uint8_t address_high;

uint8_t pagesz=0x80;

uint8_t i;

uint8_t error_count = 0;
uint8_t firstchar = 0;
unsigned int pagenumber = 0;

void (*app_start)(void) = 0x0000;


void boot_program_page (uint32_t page, uint8_t *buf)
{
	uint16_t i;

	eeprom_busy_wait ();

	boot_page_erase (page);
	boot_spm_busy_wait ();      // Wait until the memory is erased.

	for (i=0; i<SPM_PAGESIZE; i+=2)
	{
		// Set up little-endian word.

		uint16_t w = *buf++;
		w += (*buf++) << 8;

		boot_page_fill (page + i, w);
	}

	boot_page_write (page);     // Store buffer in flash page.
	boot_spm_busy_wait();       // Wait until the memory is written.

	// Reenable RWW-section again. We need this if we want to jump back
	// to the application after bootloading.

	boot_rww_enable ();
}


/* main program starts here */
int main(void)
{
	asm volatile ( "clr __zero_reg__" );
	SP=RAMEND;

	uint8_t ch,ch2;
	uint16_t w;

#ifdef QUICKSTART_MODS
	//ch = MCUSR;
	//MCUSR = 0;
	WDTCSR |= _BV(WDCE) | _BV(WDE);
	WDTCSR = 0;
#endif

	/* set pin direction for bootloader pin and enable pullup */
	/* for ATmega128, two pins need to be initialized */
#ifdef __AVR_ATmega128__
	BL_DDR &= ~_BV(BL0);
	BL_DDR &= ~_BV(BL1);
	BL_PORT |= _BV(BL0);
	BL_PORT |= _BV(BL1);
#else
	/* We run the bootloader regardless of the state of this pin.  Thus, don't
	put it in a different state than the other pins.  --DAM, 070709
	BL_DDR &= ~_BV(BL);
	BL_PORT |= _BV(BL);
	*/
#endif


	/* set LED pin as output */
	LED_DDR |= _BV(LED);
	LED_PORT |= _BV(LED);
	

	/* Ethernet stuff */
	DDRB |= (1 << DDB2) | //SS
		(1 << DDB3) | //MOSI
		(1 << DDB5); //SCK

	//Initial Pin States
	PORTB |= (1 << PINB2); //SS High

	/*  SPI Control Register */
	SPCR = (0 << SPIE) | //SPI Interrupt Enable (active high)
		(1 << SPE)  | //SPI Enable (active high)
		(0 << DORD) | //Data Order (MSB first low; LSB first high)
		(1 << MSTR) | //Master/Slave Select (Master high; Slave low)
		(0 << CPOL) | //Clock Polarity
		(0 << CPHA) | //Clock Phase
		(0 << SPR1) | //SPI Clock Rate Select 1
		(0 << SPR0); //SPI Clock Rate Select 0
	
	/* SPI Status Register */
	SPSR = (0 << SPIF) | //SPI Interrupt Flag (active high)
		(0 << WCOL) | //Write COLlision Flag (active high)
		(0 << SPI2X); //Double SPI Speed Bit (active high)

	
	//Set Gateway Address: 169.254.183.177
	spi_W5100(1, GAR2, 0xA9);
	spi_W5100(1, GAR1, 0xFE);
	spi_W5100(1, GAR2, 0xB7);
	spi_W5100(1, GAR3, 0x00);

	//Set Subnet Mask: 255.255.255.0
	spi_W5100(1, SUBR0, 0xFF);
	spi_W5100(1, SUBR1, 0xFF);
	spi_W5100(1, SUBR2, 0xFF);
	spi_W5100(1, SUBR3, 0x00);

	//Set Device MAC: 00:08:DC:01:02:03
	spi_W5100(1, SHAR0, 0x00);
	spi_W5100(1, SHAR1, 0x08);
	spi_W5100(1, SHAR2, 0xDC);
	spi_W5100(1, SHAR3, 0x01);
	spi_W5100(1, SHAR4, 0x02);
	spi_W5100(1, SHAR5, 0x03);

	//Set Device IP: 169.254.183.177
	spi_W5100(1, SIPR0, 0xA9);
	spi_W5100(1, SIPR1, 0xFE);
	spi_W5100(1, SIPR2, 0XB7);
	spi_W5100(1, SIPR3, 0xB1);
	
	//Assign 2K Memory per socket for RX and TX
	spi_W5100(1, RMSR, 0x55);
	spi_W5100(1, TMSR, 0x55);
	
	flash_led(NUM_LED_FLASHES * 2);
	
	while(1) {
		spi_W5100(1, S0_MR, 0x01); //Set TCP Mode on Socket 0

		//Use port 23
		spi_W5100(1, S0_PORT0, 0x00);
		spi_W5100(1, S0_PORT1, 0x17);

		//Set Socket Open
		spi_W5100(1, S0_CR, Sn_CR_OPEN);

		//Check if Socket has opened if not try again
		if(spi_W5100(0, S0_SR, 0x00) != Sn_SR_SOCK_INIT) {
			spi_W5100(1, S0_CR, Sn_CR_CLOSE);
			continue;
		}

		//Set Socket to Listen
		spi_W5100(1, S0_CR, Sn_CR_LISTEN);

		//Check if Socket is listening if not try again
		if(spi_W5100(0, S0_SR, 0x00) != Sn_SR_SOCK_LISTEN) {
			spi_W5100(1, S0_CR, Sn_CR_CLOSE);
			continue;
		}
		break;
	}
	
	uint32_t count = 0;
	
	while(1) {
		if(spi_W5100(0, S0_SR, 0x00) == Sn_SR_SOCK_ESTABLISHED) {
			uint16_t rx_size = (spi_W5100(0, S0_RX_RSR0, 0x00) << 8) | spi_W5100(0, S0_RX_RSR1, 0x00);
			uint16_t rx_pointer = (spi_W5100(0, S0_RX_RD0, 0x00) << 8) | spi_W5100(0, S0_RX_RD1, 0x00);
			spi_W5100(1, S0_RX_RD0, ((rx_pointer+rx_size) & 0xFF00) >> 8);
			spi_W5100(1, S0_RX_RD1, (rx_pointer+rx_size) & 0x00FF);
			spi_W5100(1, S0_CR, Sn_CR_RECV);
		
			break;
		}
		count++;
		if (count > MAX_TIME_COUNT >> 1) {
			flash_led(NUM_LED_FLASHES * 2);
			app_start();
		}
	}	

	/* 20050803: by DojoCorp, this is one of the parts provoking the
	system to stop listening, cancelled from the original */
	//putch('\0');


