sparks/ATetherBOOT/atmega_etherboot.c
			/* turn on LED */
			LED_DDR |= _BV(LED);
			LED_PORT &= ~_BV(LED);

			/* print a welcome message and command overview */
			for(i=0; welcome[i] != '\0'; ++i) {
				putch(welcome[i]);
			}

			/* test for valid commands */
			for(;;) {
				putch('\n');
				putch('\r');
				putch(':');
				putch(' ');

				ch = getch();
				putch(ch);

				/* toggle LED */
				if(ch == 't') {
					if(bit_is_set(LED_PIN,LED)) {
						LED_PORT &= ~_BV(LED);
						putch('1');
					} else {
						LED_PORT |= _BV(LED);
						putch('0');
					}
				} 

				/* read byte from address */
				else if(ch == 'r') {
					ch = getch(); putch(ch);
					addrh = gethex();
					addrl = gethex();
					putch('=');
					ch = *(uint8_t *)((addrh << 8) + addrl);
					puthex(ch);
				}

				/* write a byte to address  */
				else if(ch == 'w') {
					ch = getch(); putch(ch);
					addrh = gethex();
					addrl = gethex();
					ch = getch(); putch(ch);
					ch = gethex();
					*(uint8_t *)((addrh << 8) + addrl) = ch;
				}

				/* read from uart and echo back */
				else if(ch == 'u') {
					for(;;) {
						putch(getch());
					}
				}
#ifdef __AVR_ATmega128__
				/* external bus loop  */
				else if(ch == 'b') {
					putch('b');
					putch('u');
					putch('s');
					MCUCR = 0x80;
					XMCRA = 0;
					XMCRB = 0;
					extaddr = 0x1100;
					for(;;) {
						ch = *(volatile uint8_t *)extaddr;
						if(++extaddr == 0) {
							extaddr = 0x1100;
						}
					}
				}
#endif

				else if(ch == 'j') {
					app_start();
				}

			} /* end of monitor functions */

		}
		}
	}
	/* end of monitor */
#endif
	else if (++error_count == MAX_ERROR_COUNT) {
		app_start();
	}
	} /* end of forever loop */

}


char gethexnib(void) {
	char a;
	a = getch(); putch(a);
	if(a >= 'a') {
		return (a - 'a' + 0x0a);
	} else if(a >= '0') {
		return(a - '0');
	}
	return a;
}


char gethex(void) {
	return (gethexnib() << 4) + gethexnib();
}


void puthex(char ch) {
	char ah;

	ah = ch >> 4;
	if(ah >= 0x0a) {
		ah = ah - 0x0a + 'a';
	} else {
		ah += '0';
	}
	
	ch &= 0x0f;
	if(ch >= 0x0a) {
		ch = ch - 0x0a + 'a';
	} else {
		ch += '0';
	}
	
	putch(ah);
	putch(ch);
}


void putch(char ch)
{
	sock_close();
	uint16_t tx_write_pointer = spi_W5100(0, S0_TX_WR0, 0x00);
	tx_write_pointer = ((tx_write_pointer & 0xFF) << 8) + spi_W5100(0, S0_TX_WR1, 0x00);	
	uint16_t tx_offset = tx_write_pointer & Sn_TX_MASK;
	uint16_t tx_address = S0_TX_BASE + tx_offset;

	if((tx_offset+1) > Sn_TX_MASK) tx_address = S0_TX_BASE;
	
	spi_W5100(1, tx_address, ch);

	spi_W5100(1, S0_TX_WR0, ((tx_write_pointer+1) & 0xFF00) >> 8);
	spi_W5100(1, S0_TX_WR1, (tx_write_pointer+1) & 0xFF);
	spi_W5100(1, S0_CR, Sn_CR_SEND);
}


char getch(void)
{
	uint16_t rx_size = 0x00;
	
	uint32_t count = 0;
	while(rx_size < 0x01) {
		sock_close();
		rx_size = (spi_W5100(0, S0_RX_RSR0, 0x00) << 8) | spi_W5100(0, S0_RX_RSR1, 0x00);		
		count++;
		if (count > MAX_TIME_COUNT)
			app_start();
	}
	
	uint8_t ch = 0;

	uint16_t rx_pointer = (spi_W5100(0, S0_RX_RD0, 0x00) << 8) | spi_W5100(0, S0_RX_RD1, 0x00);
	uint16_t rx_offset = rx_pointer & Sn_RX_MASK; //Calculate offset
	uint16_t rx_address = S0_RX_BASE+rx_offset; //Calculate physical start address
	
	if((rx_offset+1) > Sn_RX_MASK) rx_address = S0_RX_BASE;
	
	ch = spi_W5100(0, rx_address, 0x00);

	spi_W5100(1, S0_RX_RD0, ((rx_pointer+1) & 0xFF00) >> 8);
	spi_W5100(1, S0_RX_RD1, (rx_pointer+1) & 0x00FF);
	spi_W5100(1, S0_CR, Sn_CR_RECV);
	return ch;
}

void getNch(uint8_t count)
{
	while(count--) {
		getch();
	}
}


void byte_response(uint8_t val)
{
	if (getch() == ' ') {
		putch(0x14);
		if (val != NULL_RESPONSE)
			putch(val);
		putch(0x10);
	} else {
		if (++error_count == MAX_ERROR_COUNT)
			app_start();
	}
}


void nothing_response(void)
{
	byte_response(NULL_RESPONSE);
}


void flash_led(uint8_t count)
{
	while (count--) {
		LED_PORT ^= _BV(LED);       // toggle!
		_delay_ms(100);
	}
}


uint8_t spi_W5100(uint8_t opcode, uint16_t address, uint8_t data) {
	PORTB = PORTB & ~(1 << PINB2); //Make SS Low

	if(opcode) spi(0xF0); //write
	else spi(0x0F); //read
	
	spi((address&0xFF00) >> 8); //Address 1
	spi(address&0xFF); //Address 2
	
	uint8_t response = spi(data); //Send data
	
	PORTB |= (1 << PINB2); //Make SS High
	
	return response;
}

uint8_t spi(uint8_t data) {
	/* Start transmission */
	SPDR = data;
	/* Wait for transmission complete */
	while(!(SPSR & (1 << SPIF)));
	/* Return received data */
	return SPDR;
}

void sock_close() {
	if(spi_W5100(0, S0_SR, 0x00) == Sn_SR_SOCK_CLOSE_WAIT) {
		spi_W5100(1, S0_CR, Sn_CR_CLOSE);
		app_start();
	}
	if(spi_W5100(0, S0_SR, 0x00) == Sn_SR_SOCK_CLOSED) {
		spi_W5100(1, S0_CR, Sn_CR_CLOSE);
		app_start();
	}
}

/* end of file ATmegaBOOT.c */
